IDEA StatiCa Open Model
BeamData.AddedMemberLength Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Added beam lenght
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double AddedMemberLength { get; set; }
Public Property AddedMemberLength As Double
	Get
	Set
public:
property double AddedMemberLength {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace